out/formula-e-front-mgu-20260729-1432/_motor_stack/openfoam_fia_water_jacket_case_work/system/controlDict
FoamFile
{
    format      ascii;
    class       dictionary;
    object      controlDict;
}

solver          incompressibleFluid;
startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         200;
deltaT          1;
writeControl    timeStep;
writeInterval   50;
purgeWrite      2;
writeFormat     ascii;
writePrecision  8;
writeCompression off;
timeFormat      general;
timePrecision   6;
runTimeModifiable true;
