out/formula-e-front-mgu-20260729-1432/_motor_stack/openfoam_fia_water_jacket_case_work/system/blockMeshDict
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1;

vertices
(
    (0 0 0)
    (0.6057649727755461 0 0)
    (0.6057649727755461 0.008 0)
    (0 0.008 0)
    (0 0 0.0035)
    (0.6057649727755461 0 0.0035)
    (0.6057649727755461 0.008 0.0035)
    (0 0.008 0.0035)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (40 8 4) simpleGrading (1 1 1)
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
    walls
    {
        type wall;
        faces
        (
            (0 1 5 4)
            (3 7 6 2)
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);
