out/formula-e-front-mgu-20260729-1432/_motor_stack/openfoam_fia_water_jacket_case_work/0/U
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (7.1428571 0 0);
boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (7.1428571 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    walls
    {
        type            noSlip;
    }
}
